loadtest/tests/loginService/loginservice.loadtest.yml
config:
  target: "http://localhost:5005"
  processor: "./customFunctions.js"
  tls:
    rejectUnauthorized: false
  http:
    # Responses have to be sent within 10 seconds or the request will be aborted
    timeout: 10
  phases:
    - duration: 30
      arrivalRate: 500

scenarios:
  - flow:
    - function: "generateRandomUsername"
    - post:
        url: "/authentication/register"
        json:
          username: "{{ username }}"
          password: "FakePassword1."