loadtest/tests/loginService/loginservice.loadtest.yml
config:
  target: "http://localhost:5005"
  processor: "./customFunctions.js"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 30 # warmup phase (establishing connection, lazy loading, optimizations etc.)
      arrivalRate: 1
      rampTo: 200
      name: "Warmup"
    - duration: 30
      arrivalRate: 200

scenarios:
  - name: Register
    weight: 1
    flow:
      - function: "generateRandomUsername"
      - post:
          url: "/authentication/register"
          json:
            username: "{{ username }}"
            password: "{{ password }}"
          afterResponse: "saveUser"
  - name: UpdatePassword
    weight: 1
    flow:
      - function: "getRegisteredUserDetails"
      - patch:
          url: "/authentication"
          json:
            username: "{{ username }}"
            newPassword: "{{ newPassword }}"

  - name: Login
    weight: 5
    flow:
      - function: "getUserDetails"
      - post:
          url: "/authentication/login"
          json:
            username: "{{ username }}"
            password: "{{ password }}"